{
  "basics": {
    "name": "Ilyes Baali",
    "label": "PhD candidate in Computational Bilogy",
    "image": "",
    "email": "ilb4001@med.cornell.edu",
    "phone": "(646) 236-4417",
    "url": "https://ilyes495.github.io/",
    "summary": "",
    "location": {
      "address": "",
      "postalCode": "NY 10065",
      "city": "New York",
      "countryCode": "US",
      "region": "New York"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "ilyes_baali07",
        "url": "https://x.com/ilyes_baali07"
      }
    ]
  },
  "work": [
    {
      "name": "Morris Lab (Prof. Quaid Morris) MSKCC and WCM, New York, NY",
      "position": "DOCTORAL RESEARCHER",
      "url": "",
      "startDate": "2021-07-01",
      "endDate": "Present",
      "summary": "• Develop a machine learning-based recalibration model that can accurately predict the cellular binding sites of RNA-Binding Proteins (RBPs) given only their intrinsic binding preferences.<br>• Reanalyze all available CLIP data to identify biases and experimental artifacts in the dataset. We found evidence that as much as a third of the eCLIP data associated with ENCODE RBPs does not measure direct binding.<br>• Investigate various machine learning techniques such as AlphFold, for representing proteins to predict the binding preferences of RNA-binding Proteins (RBPs) from their amino-acid sequences.<br>• Analyze large genomic data to understand the role of MSI2-RBP in AML, this include running various bioinformatics pipelines to detect binding sites from HyperTRIBE assay and measure translation efficiency from RiboSTAMP assay.<br>• Collaborate with wet-lab teams to address their bioinformatics needs, prepared presentations to communicate the findings and results.<br>• Supervise undergraduate interns and graduate rotation students in CLIP-seq data analysis, applying machine learning techniques, and utilizing HPC clusters.<br>• Organize regular lab-meeting for a whole year, including scheduling presentations, developing automated scripts to collect and distribute presentation feedback.",
      "highlights": ["RNA-Binding Proteins", "Machine Learning", "CLIP-seq", "AML"]
    },
    {
      "name": "Computational Biology Lab (Assoc. Prof. Hilal Kazan & Prof. Cesim Erten), Antalya, Turkey",
      "position": "RESEARCH ASSISTANT",
      "url": "",
      "startDate": "2018-10-01",
      "endDate": "2020-07-01",
      "summary": "• Developed a novel algorithm for identifying overlapping cancer driver modules using multi-omics data from The Cancer Genome Atlas (TCGA).<br>• Performed the classification and survival analysis for a novel approach named MEXCOWalk for identifying cancer driver modules.<br>• Co-supervised a final year undergraduate student’s independent study project, providing support and guidance on various aspects including experimental design, data analysis, and report writing.",
      "highlights": ["Cancer Driver Genes"]
        },
        {
      "name": "Morris Lab at University of Toronto (Prof. Quaid Morris), Toronto, Canada",
      "position": "VISITING RESEARCHER",
      "url": "",
      "startDate": "2019-06-01",
      "endDate": "2019-09-01",
      "summary": "• Designed and implemented a multitask deep learning model for predicting in vivo binding sites for RNA-binding proteins (RBPs) using in vitro binding preferences learned from paired data.<br>• This model utilizes advanced machine learning techniques to accurately predict binding site locations within the genome, which can provide valuable insights into the regulatory mechanisms of RBPs and their role in various biological processes.",
      "highlights": []
        },
        {
      "name": "Machine Learning Lab (Assoc. Prof. Hilal Kazan), Antalya, Turkey",
      "position": "SENIOR PROJECT",
      "url": "",
      "startDate": "2016-10-01",
      "endDate": "2017-08-01",
      "summary": "• Participated in the Neuroblastoma data Integration challenge organized by the CAMDA consortium, with the goal of improving the prediction of clinical outcome, survival time, or disease mechanisms through the integration of multiple data types, as compared to the original expression only study conducted by the FDA SEQC.<br>• Integrated various types of data such as gene expression and aCGH data to improve the prediction of survival time.",
      "highlights": []
        },
        {
      "name": "Digital Media and Data Reconstruction Lab (Prof. Lizhuang Ma), Shanghai, China",
      "position": "SUMMER INTERNSHIP",
      "url": "",
      "startDate": "2016-06-01",
      "endDate": "2016-09-01",
      "summary": "• Learned the principles of machine and deep learning methods, with a particular focus on convolutional neural networks.<br>• Built a face recognition system using the GoogleNet neural network, which achieved an accuracy of 94% on the LFW (Labelled Faces in the Wild) dataset.",
      "highlights": []
        }
  ],

  "education": [
    {
      
      "institution": "Weill Cornell Medicine and Memorial Sloan Kettering Cancer Center",
      "location": "New York, NY",
      "url": "https://weill.cornell.edu/",
      "area": "Computational Biology",
      "studyType": "PhD",
      "startDate": "2020-09-01",
      "endDate": "Present",
      "score": "3.78",
      "courses": ["Genomics", "Bioinformatics", "Biostatistic", "Molecular Biology and Cell Biology"]
    },
    {
      "institution": "Antalya Bilim University",
      "location": "Antalya, Turkey",
      "url": "",
      "area": "Computer Engineering",
      "studyType": "MS.C.",
      "startDate": "2018-10-01",
      "endDate": "2020-08-01",
      "score": "4",
      "courses": [],
      "summary": "3 publications, 1 first author",
      "thesis": "DriveWays: A Method for Identification of Overlapping Cancer Driver Modules"
    },
    {
      "institution": "Antalya Bilim University",
      "location": "Antalya, Turkey",
      "url": "",
      "area": "Computer Engineering",
      "studyType": "B.SC.",
      "startDate": "2014-09-01",
      "endDate": "2017-06-01",
      "score": "3.65",
      "courses": [],
      "summary": "1 publication, first author"
    },
    {
      "institution": "Antalya Bilim University",
      "location": "Antalya, Turkey",
      "url": "",
      "area": "Electrical and Electronics Engineering",
      "studyType": "B.SC.",
      "startDate": "2013-09-01",
      "endDate": "2017-06-01",
      "score": "3.65",
      "courses": [],
      "summary": "3 publications"
    }

  ],
  "awards": [
    {
      "title": "PhD Fellowship",
      "date": "2020-09-01",
      "awarder": "Followship for the whole duration of the PhD",
      "url": "",
      "summary": "The PhD Fellowship is a prestigious award that aims to support the most talented students in the field of computational biology."
    }
  ],
  
  "publications": [
    {
      "name": "DriveWays",
      "publisher": "",
      "releaseDate": "",
      "url": "",
      "summary": "DriveWays is a seed-and-extend based heuristic that identifies overlapping cancer driver modules from the graph built from the IntAct PPI network."
    }
  ],
  "skills": [
    {
      "name": "Computational Biology",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Perform various differential analyses, Analyze CLIP and RNA-editing based assays, Apply machine learning techniques to functional genomic data"
      ]
    },
    {
      "name": "Programming",
      "level": "Master",
      "icon": "fa-solid fa-code",
      "keywords": [
        "Python",
        "R",
        "Bash",
        "JavaScript",
        "SQL",
        "LaTeX"
      ]
    }
  ],
  "languages": [
    {
      "language": "Arabic",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "French ",
      "fluency": "Good",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Turkish",
      "fluency": "Basic",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Artificial Intelligence",
      "icon": "fa-solid fa-robot"
    },
    {
      "name": "Computational Biology",
      "icon": "fa-solid fa-infinity"
    }
  ],
  "references": [
    
  ],
  "projects": [
  ]
}
